group_1c/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляВхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

group_1c/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(ИдентификаторПользователяИБ) Тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияСтандартная = Истина;
		НовыйПользователь.Имя = ИмяДляВхода;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		НовыйПользователь.Записать();
		ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		ПользовательИБ.Имя = ИмяДляВхода;
		ПользовательИБ.Пароль = Пароль;
		ПользовательИБ.Записать();
	КонецЕсли;

КонецПроцедуры
